// створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     EXAMPLE:
// [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]


let b = [2, 3, 4, 5, 6];
let a = [1, 2, 3, 4, 5];

function sumArray(a, b) {
    let c = [];
    for (let i = 0; i < (a.length, b.length); i++) {
        c.push((a[i] || 0) + (b[i] || 0));
    }
    return c;
}
console.log(sumArray(a, b));

//- Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

let d = ['a', 'b', 'c'];
let f = [1,2,3]
function addNum(d, f){
    let g = [];
    for (let i = 0, i < )
}


